Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00-S1/svd/PIC32CK1025SG00100S1.svd
            <register>
               <name>LEVELC</name>
               <description>Level C</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x11111111</resetValue>
               <fields>
                  <field>
                     <name>LEVEL16</name>
                     <description>Level 16</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>LEVEL16Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Action</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOSTIRQ</name>
                           <description>Host Interrupt</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEHIRQ</name>
                           <description>Log Event and Host Interrupt</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAFEMODE</name>
                           <description>Enter Safe Mode</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSTKEY</name>
                           <description>Erase Tamper Key</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSFKEY</name>
                           <description>Erase Flash Key</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LEVEL17</name>
                     <description>Level 17</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>LEVEL17Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Action</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOSTIRQ</name>
                           <description>Host Interrupt</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEHIRQ</name>
                           <description>Log Event and Host Interrupt</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAFEMODE</name>
                           <description>Enter Safe Mode</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSTKEY</name>
                           <description>Erase Tamper Key</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSFKEY</name>
                           <description>Erase Flash Key</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LEVEL18</name>
                     <description>Level 18</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>LEVEL18Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Action</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOSTIRQ</name>
                           <description>Host Interrupt</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEHIRQ</name>
                           <description>Log Event and Host Interrupt</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAFEMODE</name>
                           <description>Enter Safe Mode</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSTKEY</name>
                           <description>Erase Tamper Key</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSFKEY</name>
                           <description>Erase Flash Key</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LEVEL19</name>
                     <description>Level 19</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>LEVEL19Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Action</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOSTIRQ</name>
                           <description>Host Interrupt</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEHIRQ</name>
                           <description>Log Event and Host Interrupt</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAFEMODE</name>
                           <description>Enter Safe Mode</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSTKEY</name>
                           <description>Erase Tamper Key</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSFKEY</name>
                           <description>Erase Flash Key</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LEVEL20</name>
                     <description>Level 20</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>LEVEL20Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Action</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOSTIRQ</name>
                           <description>Host Interrupt</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEHIRQ</name>
                           <description>Log Event and Host Interrupt</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAFEMODE</name>
                           <description>Enter Safe Mode</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSTKEY</name>
                           <description>Erase Tamper Key</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSFKEY</name>
                           <description>Erase Flash Key</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LEVEL21</name>
                     <description>Level 21</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>LEVEL21Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Action</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOSTIRQ</name>
                           <description>Host Interrupt</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEHIRQ</name>
                           <description>Log Event and Host Interrupt</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAFEMODE</name>
                           <description>Enter Safe Mode</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSTKEY</name>
                           <description>Erase Tamper Key</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSFKEY</name>
                           <description>Erase Flash Key</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LEVEL22</name>
                     <description>Level 22</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>LEVEL22Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Action</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOSTIRQ</name>
                           <description>Host Interrupt</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEHIRQ</name>
                           <description>Log Event and Host Interrupt</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAFEMODE</name>
                           <description>Enter Safe Mode</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSTKEY</name>
                           <description>Erase Tamper Key</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSFKEY</name>
                           <description>Erase Flash Key</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LEVEL23</name>
                     <description>Level 23</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>LEVEL23Select</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Action</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOSTIRQ</name>
                           <description>Host Interrupt</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEHIRQ</name>
                           <description>Log Event and Host Interrupt</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAFEMODE</name>
                           <description>Enter Safe Mode</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSTKEY</name>
                           <description>Erase Tamper Key</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERSFKEY</name>
                           <description>Erase Flash Key</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
